**`teams/nomis/rhel_7_9_oracledb_11_2`** terraform plan on `pull_request` event [#433](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_component.this["../components/rhel_7_9_oracledb_11_2/database.yml.tftpl"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: Database
            description: Database provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "1.0.9"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install, create, activate virtual environment
                          pip3.9 install virtualenv
                          mkdir /tmp/python-venv && cd "$_"
                          python3.9 -m venv ansible
                          source ansible/bin/activate
            
                          # Install ansible modules in virtual env
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
            
                          # Download playbook
                          mkdir /tmp/database-ansible-playbook && cd "$_"
                          echo "Cloning using branch=main"
                          git clone -b main --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # Install requirements in virtual env
                          python3.9 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          INSTANCE_ID=$(curl http://instance-data/latest/meta-data/instance-id)
                          PY_INTERPRETER=$(which python3.9) 
                          ansible-playbook ../teams/nomis/ansible/playbooks/database-ami-provisioning.yml \
                          --connection=local \
                          --inventory localhost, \
                          --extra-vars "instance_id=$INSTANCE_ID ansible_python_interpreter=$PY_INTERPRETER s3_bucket_with_prefix=ec2-image-builder-nomis20220314103938567000000001/oracle-11g-software" \
                          --become \
                          --tags "all,opatch,patch,deconfig"
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -r /tmp/python-venv
                          rm -r /tmp/database-ansible-playbook
        EOT
      + date_created = (known after apply)
      + description  = "Database provisioner component."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "Database"
      + owner        = (known after apply)
      + platform     = "Linux"
      + tags         = {
          + "Database-version"             = "1.0.9"
          + "application"                  = "NOMIS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "github-actor"                 = "dominicrobinson-moj"
          + "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          + "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          + "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "Database-version"             = "1.0.9"
          + "application"                  = "NOMIS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "github-actor"                 = "dominicrobinson-moj"
          + "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          + "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          + "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "1.0.9"
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_component.this["../components/rhel_7_9_oracledb_11_2/database.yml.tmpl"] will be destroyed
  - resource "aws_imagebuilder_component" "this" {
      - arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.0.8/1" -> null
      - data                  = <<-EOT
            ---
            name: Database
            description: Database provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "1.0.8"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install, create, activate virtual environment
                          pip3.9 install virtualenv
                          mkdir /tmp/python-venv && cd "$_"
                          python3.9 -m venv ansible
                          source ansible/bin/activate
            
                          # Install ansible modules in virtual env
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
            
                          # Download playbook
                          mkdir /tmp/database-ansible-playbook && cd "$_"
                          git clone -b ${BRANCH_NAME} --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # Install requirements in virtual env
                          python3.9 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          INSTANCE_ID=$(curl http://instance-data/latest/meta-data/instance-id)
                          PY_INTERPRETER=$(which python3.9) 
                          ansible-playbook ../teams/nomis/ansible/playbooks/database-ami-provisioning.yml \
                          --connection=local \
                          --inventory localhost, \
                          --extra-vars "instance_id=$INSTANCE_ID ansible_python_interpreter=$PY_INTERPRETER s3_bucket_with_prefix=ec2-image-builder-nomis20220314103938567000000001/oracle-11g-software" \
                          --become \
                          --tags "all,opatch,patch,deconfig"
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -r /tmp/python-venv
                          rm -r /tmp/database-ansible-playbook
        EOT -> null
      - date_created          = "2022-09-12T14:27:27.113Z" -> null
      - description           = "Database provisioner component." -> null
      - encrypted             = true -> null
      - id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.0.8/1" -> null
      - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
      - name                  = "Database" -> null
      - owner                 = "374269020027" -> null
      - platform              = "Linux" -> null
      - supported_os_versions = [] -> null
      - tags                  = {
          - "Database-version"             = "1.0.8"
          - "application"                  = "NOMIS"
          - "branch"                       = "main"
          - "business-unit"                = "HMPPS"
          - "github-actor"                 = "dominicrobinson-moj"
          - "github-branch"                = "main"
          - "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          - "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5"
          - "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5"
          - "is-production"                = "true"
          - "os-version"                   = "rhel 7.9"
          - "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"             = "release"
          - "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        } -> null
      - tags_all              = {
          - "Database-version"             = "1.0.8"
          - "application"                  = "NOMIS"
          - "branch"                       = "main"
          - "business-unit"                = "HMPPS"
          - "github-actor"                 = "dominicrobinson-moj"
          - "github-branch"                = "main"
          - "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          - "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5"
          - "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5"
          - "is-production"                = "true"
          - "os-version"                   = "rhel 7.9"
          - "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"             = "release"
          - "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        } -> null
      - type                  = "BUILD" -> null
      - version               = "1.0.8" -> null
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-oracledb-11-2"
        name         = "nomis_rhel_7_9_oracledb_11_2"
      ~ tags         = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-oracledb-11-2" -> (known after apply)
      ~ date_created                     = "2022-09-12T16:46:52.576Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-12T18:09:37.543Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-12T16:46:52.576Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-oracledb-11-2" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.5" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-0-5" -> (known after apply)
        name                             = "nomis_rhel_7_9_oracledb_11_2"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ image_tests_configuration {
          ~ image_tests_enabled = true -> false
            # (1 unchanged attribute hidden)
        }

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.5" -> (known after apply)
      ~ date_created     = "2022-09-12T16:46:50.814Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.5" -> (known after apply)
        name             = "nomis_rhel_7_9_oracledb_11_2"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-0d74e3e6901bd5981" -> "ami-0c0542206b72be8b5" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.5" -> "0.0.6" # forces replacement
        # (1 unchanged attribute hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdg" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdg"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdh" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdh"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdi" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdi"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdk" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdk"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sds" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 4 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sds"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 4
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.0.8/1" -> (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-0-5" -> (known after apply)
      ~ date_created                  = "2022-09-12T16:46:49.823Z" -> (known after apply)
      ~ date_updated                  = "2022-09-13T09:23:51.809Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-0-5" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_oracledb_11_2_0_0_5" -> "nomis_rhel_7_9_oracledb_11_2_0_0_6" # forces replacement
      ~ resource_tags                 = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "Database-version"             = "1.0.8" -> "1.0.9"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.0.5" -> "nomis_rhel_7_9_oracledb_11_2/0.0.6"
            # (10 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```